#pragma once
/*
capacity	Возвращает число элементов, которое вектор может содержать без выделения дополнительного пространства.
size	Возвращает количество элементов в векторе.
reserve	Резервирует минимальную длину хранилища для объекта вектора
resize	Определяет новый размер вектора. (2 overload)
empty	Проверяет, пуст ли контейнер вектора.
shrink_to_fit	Удаляет лишнюю емкость.
push_back	Добавляет элемент в конец вектора
pop_back	Удаляет элемент в конце вектора.
clear	Очищает элементы вектора.
insert	Вставляет элемент или многие элементы в вектор по заданной позиции. (3 overload)
at	Возвращает ссылку на элемент в заданном положении в векторе.
back	Возвращает ссылку на последний элемент вектора.
front	Возвращает ссылку на первый элемент в векторе.
data	Возвращает указатель на первый элемент в векторе.
*/


/*
erase	Удаляет элемент или диапазон элементов в векторе из заданных позиций.
begin	Возвращает итератор произвольного доступа, указывающий на первый элемент в векторе.
end		Возвращает итератор произвольного доступа, который указывает на конец вектора.
swap	Меняет местами элементы двух векторов.
assign	Удаляет вектор и копирует указанные элементы в пустой вектор.
emplace	Вставляет элемент, созданный на месте, в указанное положение в векторе.
emplace_back	Добавляет элемент, созданный на месте, в конец вектора.
*/
